Before you turn this problem in, make sure everything runs as expected. First, **restart the kernel** (in the menu bar, select Kernel$\rightarrow$Restart) and then **run all cells** (in the menu bar, select Cell$\rightarrow$Run All).

Make sure that in addition to the code, you provide written answers for all questions of the assignment. 

Below, please fill in your name and collaborators:

In [1483]:
NAME = "Uzma Ahmad"
COLLABORATORS = ""

## Assignment 2 - Data Analysis using Pandas
**(15 points total)**

For this assignment, we will analyze the open dataset with data on the passengers aboard the Titanic.

The data file for this assignment can be downloaded from Kaggle website: https://www.kaggle.com/c/titanic/data, file `train.csv`. It is also attached to the assignment page. The definition of all variables can be found on the same Kaggle page, in the Data Dictionary section.

Read the data from the file into pandas DataFrame. Analyze, clean and transform the data to answer the following question: 

**What categories of passengers were most likely to survive the Titanic disaster?**

**Question 1.**  _(4 points)_
* The answer to the main question - What categories of passengers were most likely to survive the Titanic disaster? _(2 points)_
  
**The group with the highest survival rate on the Titanic consisted (Females, Children, First-Class) of first-class women with small families.**

* The detailed explanation of the logic of the analysis _(2 points)_

**Women holding the titles Miss or Mrs, traveling in first class, and having a family size of 1 to 3 had nearly a 100% survival rate. This was primarily due to the "women and children first" policy, which prioritized their evacuation. Additionally, first-class passengers had early access to lifeboats, increasing their chances of survival. Smaller family sizes also played a role, as they could evacuate together without delays.**

**Analyzed survival by class, title and family size**

**Question 2.**  _(3 points)_
* What other attributes did you use for the analysis? Explain how you used them and why you decided to use them.
  
**Sex informed that female had 74% survival rate.**

**The AgeGroup informed that children under 10 had 59% survival rate**

**Analyzing Embarked, Sex, Pclass confirmed our analysis tht female passengers had significantly higher survival rates than males, especially in 1st class, while males, particularly in 3rd class, had much lower survival rates across all embarkation points.**

**Analyzing Title and Age Group confirmed our analysis that Miss passengers (both children and adults) showing particularly strong survival rates (ranging from 61.29% for children to 72.36% for adults), and Mrs passengers having the highest survival rates (85.71% for teens and 78.63% for adults). Master passengers (young boys), also had the highest survival rates children showing a survival rate of 57.58% and teens at 66.67%.**

* Provide a complete list of all attributes used.

**Survived (target variable), Title (Extracted from name), Sex, Age Group (Age), Pclass, Family Size (SibSp, Parch), Embarked**

**Question 3.**  _(3 points)_
* Did you engineer any attributes (created new attributes)? If yes, explain the rationale and how the new attributes were used in the analysis?

**Family Size (SibSp + Parch + 1): Larger families may have been prioritized together or faced more evacuation challenges. This attribute helps analyze survival based on family size.**

**Title (Extracted from Name): Titles reflect social status, which could influence survival. They were grouped into categories (e.g., "Mr", "Mrs", "Miss", "Master"..) to examine the impact of social rank on survival.**

**AgeGroup: Categorizes passengers into age ranges: Child (0-10), Teen (10-18), Adult (18-60), and Senior (60-80) to analyze survival patterns based on age.**

* If you have excluded any attributes from the analysis, provide an explanation why you believe they can be excluded.

**PassengerId: It’s just an identifier and doesn’t affect survival.**

**Ticket: No clear pattern in ticket numbers affecting survival.**

**Cabin (687 missing): Dropped due to excessive missing values.**

**Fare: A correlation of -0.5495 between Fare and Pclass indicates that as Pclass increases (from 3rd to 1st), Fare tends to decrease, with 1st class passengers paying higher fares than 3rd class passengers., which already provides similar insights, making it redundant in the analysis.**

**Question 4.**  _(5 points)_
* How did you treat missing values for those attributes that you included in the analysis (for example, `age` attribute)? Provide a detailed explanation in the comments.

**Age (177 missing): Imputing the missing age values using a single median would overlook important patterns in the data, such as the fact that passengers in the first class were generally older, while those in the third class were younger. By imputing the missing age values based on the median age grouped by passenger class (Pclass) and sex, we account for the significant variations in age distribution across different classes and genders. This approach provides a more accurate imputation.**

**Embarked (2 missing): Imputed with the most common embarkation point, 'S' (Southampton).**

In [1487]:
import pandas as pd
import numpy as np
df_original = pd.read_csv('train.csv')
df = df_original.copy()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [1488]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [1489]:
#Check for null values
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [1490]:
df["Age"].median()

28.0

In [1491]:
df.groupby(["Pclass","Sex"])["Age"].median()

Pclass  Sex
1       female    35.0
        male      40.0
2       female    28.0
        male      30.0
3       female    21.5
        male      25.0
Name: Age, dtype: float64

In [1492]:
# Fill "Age by grouping "Pclass", "Sex" to get accuracy and calculating median 
df["Age"] = df.groupby(["Pclass", "Sex"])["Age"].transform(lambda x: x.fillna(x.median()))

In [1493]:
# Drop the "Cabin" column as it has too many missing values
df.drop(columns=["Cabin"], inplace=True)

In [1494]:
# Fill "Embarked" missing value with the most common port
df["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [1495]:
df['Embarked'] = df['Embarked'].fillna('S')

In [1496]:
# Removing columns not useful for analysis
df.drop(columns=["PassengerId", "Ticket"],inplace=True)

In [1497]:
# Extracting "Title" 
df["Title"] = df["Name"].str.extract(r' ([A-Za-z]+)\.')
df["Title"].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'Countess',
       'Jonkheer'], dtype=object)

In [1498]:
df["Title"] = df["Title"].replace(["Mlle", "Ms"], "Miss")
df["Title"] = df["Title"].replace(["Mme"], "Mrs")
df["Title"] = df["Title"].replace(["Don", "Sir", "Countess", "Jonkheer", "Lady", "Dona"], "Noble")
df["Title"] = df["Title"].replace(["Capt", "Col", "Dr", "Major", "Rev"], "Officer")

In [1499]:
# Creating column "Family Size"
df["FamilySize"] = df["SibSp"] + df["Parch"] + 1

In [1500]:
# Convert Sex to 0/1
df["Sex"] = df["Sex"].map({"male": 0, "female": 1})

In [1501]:
# Creating "AgeGroup" column
df["AgeGroup"] = pd.cut(df["Age"], bins=[0, 10, 18, 60, 80], labels=["Child", "Teen", "Adult", "Senior"])

In [1502]:
# Final Clean Data
df.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title,FamilySize,AgeGroup
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,7.2500,S,Mr,2,Adult
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,71.2833,C,Mrs,2,Adult
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,7.9250,S,Miss,1,Adult
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,53.1000,S,Mrs,2,Adult
4,0,3,"Allen, Mr. William Henry",0,35.0,0,0,8.0500,S,Mr,1,Adult
5,0,3,"Moran, Mr. James",0,25.0,0,0,8.4583,Q,Mr,1,Adult
6,0,1,"McCarthy, Mr. Timothy J",0,54.0,0,0,51.8625,S,Mr,1,Adult
7,0,3,"Palsson, Master. Gosta Leonard",0,2.0,3,1,21.0750,S,Master,5,Child
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,27.0,0,2,11.1333,S,Mrs,3,Adult
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,14.0,1,0,30.0708,C,Mrs,2,Teen

In [1503]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    891 non-null    int64
 1   Pclass      891 non-null    int64
 2   Name        891 non-null    object
 3   Sex         891 non-null    int64
 4   Age         891 non-null    float64
 5   SibSp       891 non-null    int64
 6   Parch       891 non-null    int64
 7   Fare        891 non-null    float64
 8   Embarked    891 non-null    object
 9   Title       891 non-null    object
 10  FamilySize  891 non-null    int64
 11  AgeGroup    891 non-null    category
dtypes: category(1), float64(2), int64(6), object(3)
memory usage: 77.8+ KB

In [1504]:
# Correlation between Fare and Pclass
df["Fare"].corr(df["Pclass"])

-0.5494996199439072

In [1505]:
# Calculate survival rate by gender
df.groupby("Sex")["Survived"].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [1545]:
# Calculate survival rate by Title
df.groupby('Title')['Survived'].mean()

Title
Master     0.575000
Miss       0.702703
Mr         0.156673
Mrs        0.793651
Noble      0.600000
Officer    0.277778
Name: Survived, dtype: float64

In [1507]:
# Calculate survival rate by age group
df.groupby("AgeGroup", observed=False)["Survived"].mean()

AgeGroup
Child     0.593750
Teen      0.426667
Adult     0.365753
Senior    0.227273
Name: Survived, dtype: float64

In [1508]:
# Calculate survival rate by passenger class
df.groupby("Pclass")["Survived"].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [1509]:
# Calculate survival rate by family size
df.groupby('FamilySize')['Survived'].mean()

FamilySize
1     0.303538
2     0.552795
3     0.578431
4     0.724138
5     0.200000
6     0.136364
7     0.333333
8     0.000000
11    0.000000
Name: Survived, dtype: float64

In [1510]:
# Calculate survival rate by embarked port
df.groupby('Embarked')['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

In [1511]:
df.pivot_table(values="Survived", index="Pclass", columns="Sex", aggfunc="mean")

Sex            0         1
Pclass
1       0.368852  0.968085
2       0.157407  0.921053
3       0.135447  0.500000

In [1512]:
# Analyzed survival by class, title and family size
df.groupby(["Pclass","Title","FamilySize"])["Survived"].mean().unstack()

FamilySize            1         2         3     4    5    6         7    8   \
Pclass Title
1      Master        NaN       NaN  1.000000  1.00  NaN  NaN       NaN  NaN
       Miss     0.962963  1.000000  1.000000  0.50  1.0  1.0       NaN  NaN
       Mr       0.328358  0.366667  0.428571  1.00  NaN  0.0       NaN  NaN
       Mrs      1.000000  1.000000  1.000000  0.50  NaN  NaN       NaN  NaN
       Noble    0.333333  1.000000       NaN   NaN  NaN  NaN       NaN  NaN
       Officer  0.571429       NaN  0.333333   NaN  NaN  NaN       NaN  NaN
2      Master        NaN       NaN  1.000000  1.00  NaN  NaN       NaN  NaN
       Miss     0.904762  1.000000  1.000000  1.00  NaN  NaN       NaN  NaN
       Mr       0.106061  0.076923  0.000000  0.00  NaN  NaN       NaN  NaN
       Mrs      0.909091  0.866667  0.875000  1.00  1.0  1.0       NaN  NaN
       Officer  0.000000  0.000000       NaN   NaN  NaN  NaN       NaN  NaN
3      Master        NaN  1.000000  1.000000  1.00  0.0  0.0  0.333333  0.0
       Miss     0.600000  0.500000  0.600000  0.75  0.0  0.0  0.333333  0.0
       Mr       0.121212  0.080000  0.105263  0.00  0.0  0.0  0.000000  0.0
       Mrs      0.800000  0.533333  0.500000  1.00  0.0  0.0  0.500000  0.0

FamilySize       11
Pclass Title
1      Master   NaN
       Miss     NaN
       Mr       NaN
       Mrs      NaN
       Noble    NaN
       Officer  NaN
2      Master   NaN
       Miss     NaN
       Mr       NaN
       Mrs      NaN
       Officer  NaN
3      Master   0.0
       Miss     0.0
       Mr       0.0
       Mrs      NaN

In [1513]:
# Analyzed survival by title and age group
df.groupby(["Title", "AgeGroup"],observed=False)["Survived"].mean()

Title    AgeGroup
Master   Child       0.575758
         Teen        0.666667
         Adult       0.500000
         Senior           NaN
Miss     Child       0.612903
         Teen        0.700000
         Adult       0.723577
         Senior      1.000000
Mr       Child            NaN
         Teen        0.085714
         Adult       0.163793
         Senior      0.111111
Mrs      Child            NaN
         Teen        0.857143
         Adult       0.786325
         Senior      1.000000
Noble    Child            NaN
         Teen             NaN
         Adult       0.600000
         Senior           NaN
Officer  Child            NaN
         Teen             NaN
         Adult       0.294118
         Senior      0.000000
Name: Survived, dtype: float64

In [1514]:
# Analyzed survival by sex, class and embarkation
df.groupby(["Sex","Pclass","Embarked"])["Survived"].mean()

Sex  Pclass  Embarked
0    1       C           0.404762
             Q           0.000000
             S           0.354430
     2       C           0.200000
             Q           0.000000
             S           0.154639
     3       C           0.232558
             Q           0.076923
             S           0.128302
1    1       C           0.976744
             Q           1.000000
             S           0.960000
     2       C           1.000000
             Q           1.000000
             S           0.910448
     3       C           0.652174
             Q           0.727273
             S           0.375000
Name: Survived, dtype: float64